In [ ]:
import pandas
pandas.__version__

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
#series
counts=pd.Series([101,102,102,104])

In [4]:
counts

0    101
1    102
2    102
3    104
dtype: int64

In [5]:
counts.values

array([101, 102, 102, 104], dtype=int64)

In [ ]:
counts.index

In [7]:
alp=pd.Series(["A","B","C","D","E"])
alp

0    A
1    B
2    C
3    D
4    E
dtype: object

In [8]:
alp[4]

'E'

In [9]:
alph=pd.Series([1,2,3,4,5],
               index=["A","B","C","D","E"])

In [10]:
alph

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [12]:
alph["D"]

4

In [16]:
np.log(alph)

A    0.000000
B    0.693147
C    1.098612
D    1.386294
E    1.609438
dtype: float64

In [18]:
alph[alph>2]

C    3
D    4
E    5
dtype: int64

In [19]:
alph_dict = {'A': 1, 'B': 2, 'C': 3, 'D': 4}
print(alph_dict)
pd.Series(alph_dict)

{'A': 1, 'B': 2, 'C': 3, 'D': 4}

A    1
B    2
C    3
D    4
dtype: int64

In [21]:
data = {"Name": ["AB", "CD", "EF", "GH", "IJ"],
        "Year": [1996,1997,1998,1999,2000],
        "Age": [24,23,22,21,20]}
print(data)
data = pd.DataFrame(data)
data

{'Name': ['AB', 'CD', 'EF', 'GH', 'IJ'], 'Year': [1996, 1997, 1998, 1999, 2000], 'Age': [24, 23, 22, 21, 20]}

  Name  Year  Age
0   AB  1996   24
1   CD  1997   23
2   EF  1998   22
3   GH  1999   21
4   IJ  2000   20

In [22]:
df = pd.DataFrame(data, columns=["Name", "Age" ,"Year"])
df

  Name  Age  Year
0   AB   24  1996
1   CD   23  1997
2   EF   22  1998
3   GH   21  1999
4   IJ   20  2000

In [23]:
df['Extra']=df.Year/df.Age

In [24]:
df

  Name  Age  Year       Extra
0   AB   24  1996   83.166667
1   CD   23  1997   86.826087
2   EF   22  1998   90.818182
3   GH   21  1999   95.190476
4   IJ   20  2000  100.000000

In [25]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
df

  Name  Age  Year       Extra  Serie_aligned
0   AB   24  1996   83.166667              0
1   CD   23  1997   86.826087              1
2   EF   22  1998   90.818182              2
3   GH   21  1999   95.190476              3
4   IJ   20  2000  100.000000              4

In [26]:
df.to_dict()

{'Name': {0: 'AB', 1: 'CD', 2: 'EF', 3: 'GH', 4: 'IJ'},
 'Age': {0: 24, 1: 23, 2: 22, 3: 21, 4: 20},
 'Year': {0: 1996, 1: 1997, 2: 1998, 3: 1999, 4: 2000},
 'Extra': {0: 83.16666666666667,
  1: 86.82608695652173,
  2: 90.81818181818181,
  3: 95.19047619047619,
  4: 100.0},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [27]:
pd.DataFrame(df.to_dict())

  Name  Age  Year       Extra  Serie_aligned
0   AB   24  1996   83.166667              0
1   CD   23  1997   86.826087              1
2   EF   22  1998   90.818182              2
3   GH   21  1999   95.190476              3
4   IJ   20  2000  100.000000              4

In [28]:
data = [{'a': i, 'b':10* i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [29]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [36]:
pd.DataFrame(np.random.randint(0,5),
             columns=['ooo', 'nnn'],
             index=['a', 'b', 'c'])

   ooo  nnn
a    2    2
b    2    2
c    2    2

In [38]:
ind=pd.Index([10,20,30,40,50])
ind

Int64Index([10, 20, 30, 40, 50], dtype='int64')

In [39]:
ind[1]

20

In [40]:
ind[:-1]

Int64Index([10, 20, 30, 40], dtype='int64')

In [41]:
ind[0::2]

Int64Index([10, 30, 50], dtype='int64')

In [42]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [45]:
rng = np.random.RandomState(10)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    9
1    4
2    0
3    1
dtype: int32

In [46]:
dfr = pd.DataFrame(rng.randint(0, 10, (4, 4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

   A  B  C  D
0  9  0  1  8
1  9  0  8  6
2  4  3  0  4
3  6  8  1  8

In [47]:
np.exp(ser)

0    8103.083928
1      54.598150
2       1.000000
3       2.718282
dtype: float64

In [49]:
np.sin(dfr * np.pi / 5)

          A         B         C         D
0 -0.587785  0.000000  0.587785 -0.951057
1 -0.587785  0.000000 -0.951057 -0.587785
2  0.587785  0.951057  0.000000  0.587785
3 -0.587785 -0.951057  0.587785 -0.951057

In [51]:
area = pd.Series({'Alaska': 1723335, 'Texas': 695665,
                  'California': 423965}, name='area')
population = pd.Series({'California': 38332520, 'Texas': 26448195,
                        'New York': 19651125}, name='population')
print(area)
population

Alaska        1723335
Texas          695665
California     423965
Name: area, dtype: int64

California    38332520
Texas         26448195
New York      19651125
Name: population, dtype: int64

In [52]:
population/area

Alaska              NaN
California    90.414350
New York            NaN
Texas         38.018579
dtype: float64

In [53]:
population.index | area.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [55]:
A = pd.Series([10,20,40], index=[0, 1, 2])
B = pd.Series([100,200,300], index=[1, 2, 3])
print(A)
print(B)
B
A * B

0    10
1    20
2    40
dtype: int64
1    100
2    200
3    300
dtype: int64

0       NaN
1    2000.0
2    8000.0
3       NaN
dtype: float64

In [56]:
A.add(B, fill_value=0)

0     10.0
1    120.0
2    240.0
3    300.0
dtype: float64

In [57]:
df

  Name  Age  Year       Extra  Serie_aligned
0   AB   24  1996   83.166667              0
1   CD   23  1997   86.826087              1
2   EF   22  1998   90.818182              2
3   GH   21  1999   95.190476              3
4   IJ   20  2000  100.000000              4

In [71]:
df2 = pd.DataFrame({"Name": ["AB", "CD", "EF"], "SAl": ["100000", "200000", "300000"]})
df

  Name  Age  Year       Extra  Serie_aligned
0   AB   24  1996   83.166667              0
1   CD   23  1997   86.826087              1
2   EF   22  1998   90.818182              2
3   GH   21  1999   95.190476              3
4   IJ   20  2000  100.000000              4

In [72]:
df

  Name  Age  Year       Extra  Serie_aligned
0   AB   24  1996   83.166667              0
1   CD   23  1997   86.826087              1
2   EF   22  1998   90.818182              2
3   GH   21  1999   95.190476              3
4   IJ   20  2000  100.000000              4

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [73]:
df.merge(df2)

  Name  Age  Year      Extra  Serie_aligned     Sal
0   AB   24  1996  83.166667              0  100000
1   CD   23  1997  86.826087              1  200000
2   EF   22  1998  90.818182              2  300000

In [75]:
df3 = pd.DataFrame({"Name": ["AB", "CD"], "SAl": ["100000", "200000"]})
df3
df.merge(df3, right_on='Name', left_on='Name')

  Name  Age  Year      Extra  Serie_aligned     SAl
0   AB   24  1996  83.166667              0  100000
1   CD   23  1997  86.826087              1  200000

In [77]:
df4 = pd.DataFrame({"Name": ["GH", "IJ"], "Year": [1999,2000]})
df.merge(df4, how='outer')

  Name  Age  Year       Extra  Serie_aligned
0   AB   24  1996   83.166667              0
1   CD   23  1997   86.826087              1
2   EF   22  1998   90.818182              2
3   GH   21  1999   95.190476              3
4   IJ   20  2000  100.000000              4

In [78]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])

In [79]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [80]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [81]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [82]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64